#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main()
{
	char a = 3;
	//00000000000000000000000000000011
	//00000011 提升后为上式
    char b = 127;
	//00000000000000000000000001111111
	//01111111 提升后为上式
	char c = a + b;
	//00000000000000000000000000000011
	//00000000000000000000000001111111
    //00000000000000000000000010000010(相加)
	//c 10000010
	//11111111111111111111111110000010 -补码(提升后)
	//11111111111111111111111110000001 -反码
	//10000000000000000000000001111110 -源码(注意符号位不变)
	printf("%d\n", c);//使用%d打印，整形提升

	char d = 1;
	printf("%d\n", sizeof(c));
	printf("%d\n", sizeof(+c));//参与了运算，但并未真正计算
	printf("%d\n", sizeof(-c));
	printf("%d\n", sizeof(!c));//其实是4,编译器问题

	return 0;
}